
Функция rc_StatePOST(Запрос)
	Возврат HTTPКлиентAPI.ОбработатьЗапросУниверсально(Запрос, ИмяМодуля());
КонецФункции

Функция rc_StateGET(Запрос)
	Возврат HTTPКлиентAPI.ОбработатьЗапросУниверсально(Запрос, ИмяМодуля());
КонецФункции

Функция ИмяМодуля()
	Возврат "HTTPКлиентAPI";
КонецФункции

Функция РасширенияБазыPost(Запрос)
	
	ТелоHTTPЗапроса = Запрос.ПолучитьТелоКакСтроку();
	Попытка
		
		ДанныеHTTPЗапроса = ОбщегоНазначения.JSONВЗначение(ТелоHTTPЗапроса,, Ложь);	
		HTTPРасширенияБазы.ВалидироватьЗапрос(ТелоHTTPЗапроса, HTTPРасширенияБазы.КонструкторОбязательныхПолейПостроке("ИдентификаторИБ"));	
		МассивЗначений = HTTPРасширенияБазы.ПолучитьИнформациюПоРасширениям(ДанныеHTTPЗапроса.ИдентификаторИБ);
	
		Возврат СоздатьОтветHTTPСервиса(ОбщегоНазначения.ЗначениеВJSON(МассивЗначений));
	Исключение
		ТекстОшибки = "Ошибка при выполнении запроса: " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("API.ExctensionsInfo", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);	
		Возврат ТекстОшибки;
	КонецПопытки;
	
КонецФункции 

Функция СоздатьОтветHTTPСервиса(Данные, Код = 200, Параметры = Неопределено) Экспорт
	
	Ответ = Новый HTTPСервисОтвет(Код);
	Если Параметры = Неопределено Тогда
		Параметры = Новый Соответствие;
	КонецЕсли;
	
	Если ТипЗнч(Данные) = Тип("Строка") Тогда
		
		Если Код >= 400 Тогда
			Ответ.Причина = Данные;
			Комментарий   = "Код состояния: " + Строка(Код) + " " + Данные;
			Если Параметры["ДанныеЗапроса"] <> Неопределено Тогда
				Комментарий = Комментарий + Символы.ПС + "Параметры запроса: " + Символы.ПС + Параметры["ДанныеЗапроса"]; 
			КонецЕсли;
			Если Параметры["Ошибка"] <> Неопределено Тогда
				Комментарий = Комментарий + Символы.ПС + "Описание ошибки: " + Символы.ПС + Параметры["Ошибка"]; 
			КонецЕсли;
			Ответ.УстановитьТелоИзСтроки(Комментарий);
		Иначе
			ТекДанные = Данные;
			Ответ.УстановитьТелоИзСтроки(ТекДанные);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
		Ответ.УстановитьТелоИзДвоичныхДанных(Данные);
	Иначе
		СтрокаДанных = ОбщегоНазначения.ЗначениеВJSON(Данные);
		Ответ.УстановитьТелоИзСтроки(СтрокаДанных, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	КонецЕсли;
	
	Если Параметры <> Неопределено Тогда
		Если Параметры["ContentType"] <> Неопределено Тогда
			Ответ.Заголовки.Вставить("Content-Type",  Параметры["ContentType"]);
		ИначеЕсли Параметры["ТипКонтента"] <> Неопределено Тогда
			Ответ.Заголовки.Вставить("Content-Type",  Параметры["ТипКонтента"]);
		КонецЕсли;		
	КонецЕсли;
	
	Если Ответ.Заголовки["Content-Type"] = Неопределено Тогда
		Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции