
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ПометкаУдаления И СтатусОбработки = Перечисления.СтатусыОбработкиЗапросовНаАкцепт.Принят Тогда
		
		СсылкаИБ = ИнформационныеБазы.НайтиЭлементПоИдентификатору(ИдентификаторИБ);
		
		Если СсылкаИБ.ПометкаУдаления Тогда
			
			ОбъектИБ = СсылкаИБ.ПолучитьОбъект();
			ОбъектИБ.УстановитьПометкуУдаления(Ложь);
			
		КонецЕсли;
		
	ИначеЕсли ПометкаУдаления И ЗначениеЗаполнено(ИнформационнаяБаза)
		И ОбщегоНазначения.СсылкаСуществует(ИнформационнаяБаза) Тогда
		
		ОбъектИБ = ИнформационнаяБаза.ПолучитьОбъект();
		ОбъектИБ.УстановитьПометкуУдаления(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

