
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область СлужебныеПроцедурыИФункции

Функция НайтиПоРеквизитам(СтруктураПоиска) Экспорт
	
	Если ТипЗнч(СтруктураПоиска) <> Тип("Структура") Тогда
		Возврат Справочники.ВерсииКонфигураций.ПустаяСсылка();
	КонецЕсли;
	
	Если СтруктураПоиска.Количество() = 0 Тогда
		Возврат Справочники.ВерсииКонфигураций.ПустаяСсылка();
	КонецЕсли;
	
	Условие = "ГДЕ ";
	Первый = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВерсииКонфигураций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВерсииКонфигураций КАК ВерсииКонфигураций";
	
	Для Каждого КиЗ Из СтруктураПоиска Цикл
		Если Не Первый Тогда
			Условие = Условие + Символы.ПС + "И ";
		КонецЕсли;
		Условие = Условие + "ВерсииКонфигураций." + КиЗ.Ключ + " = &" + КиЗ.Ключ;
		Запрос.УстановитьПараметр(КиЗ.Ключ, КиЗ.Значение);
		Первый = Ложь;
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + Символы.ПС + Условие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ВерсииКонфигураций.ПустаяСсылка();
	
КонецФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьВерсииКонфигураций();
	
КонецПроцедуры

Процедура ЗаполнитьВерсииКонфигураций()
	
	
	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.БухгалтерияПредприятия, "3.0.185.19");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.БухгалтерияПредприятияКОРП, "3.0.185.19");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.ЗарплатаИУправлениеПерсоналом, "3.1.35.48");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.ЗарплатаИУправлениеПерсоналомКОРП, "3.1.35.48");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.УправлениеПредприятием, "2.5.24.65");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.УправлениеХолдингом, "3.2.10.42");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.УправлениеХолдингомERP, "3.2.6.3");
	
	
	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.УправлениеУчебнымЦентром, "2.0.22.1");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.Метрология, "3.0.59.54");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.ОхранаОкружающейСреды, "2.0.10.110");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.УправлениеНСИ, "2.5.6.1");
	
КонецПроцедуры

Процедура ОписатьВерсиюКонфигурации(ВидКонфигурации, НомерВерсии) Экспорт
	
	СсылкаВерсии = Справочники.ВерсииКонфигураций.НайтиПоРеквизитам(Новый Структура("ВидКонфигурации,Наименование", ВидКонфигурации, НомерВерсии));
	
	Если ЗначениеЗаполнено(СсылкаВерсии) Тогда
		Элемент = СсылкаВерсии.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.ВерсииКонфигураций.СоздатьЭлемент();
		Элемент.УстановитьНовыйКод();
	КонецЕсли;
	
	Если Элемент.Наименование <> НомерВерсии Тогда
		Элемент.Наименование = НомерВерсии;
	КонецЕсли;
	
	Если Элемент.ВидКонфигурации <> ВидКонфигурации Тогда
		Элемент.ВидКонфигурации = ВидКонфигурации;
	КонецЕсли;
		
	Если Элемент.Модифицированность() Тогда
		Элемент.ОбменДанными.Загрузка = Истина;
		Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Элемент.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
