 Процедура ВалидироватьЗапрос(ТелоСообщения, ОбязательныеПоля) Экспорт
	
	Если ПустаяСтрока(ТелоСообщения) Тогда
		ВызватьИсключение "Тело запроса пустое";		
	КонецЕсли;
	
	Попытка
		Данные = ОбщегоНазначения.JSONВЗначение(ТелоСообщения,, Ложь);
	Исключение
		ВызватьИсключение "Ошибка парсинга JSON" + ОписаниеОшибки();	
	КонецПопытки;
	
	Если Данные = Неопределено Тогда
		ВызватьИсключение "Ошибка парсинга JSON";
	КонецЕсли;
	
	Для Каждого Поле Из ОбязательныеПоля Цикл
		Если Не Данные.Свойство(Поле) Тогда
			ВызватьИсключение "Отсутствует обязательное поле: " + Поле;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 
 
 Функция ПолучитьИнформациюПоРасширениям(ИдентификаторИБ) Экспорт
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеРасширенияКонфигурацииСрезПоследних.РасширениеКонфигурации.Наименование КАК РасширениеКонфигурации
		|ИЗ
		|	РегистрСведений.УстановленныеРасширенияКонфигураций.СрезПоследних(, ИнформационнаяБаза.ИдентификаторИБ = &ИдентификаторИБ) КАК УстановленныеРасширенияКонфигурацииСрезПоследних
		|ГДЕ
		|	НЕ УстановленныеРасширенияКонфигурацииСрезПоследних.Исключить";
	
	Запрос.УстановитьПараметр("ИдентификаторИБ", ИдентификаторИБ);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	МассивРасширений = Новый Массив;
	
	Пока РезультатЗапроса.Следующий()цикл
		
		МассивРасширений.Добавить(РезультатЗапроса.РасширениеКонфигурации); 
		
	конецЦикла; 

	Возврат МассивРасширений;
	
КонецФункции

Функция КонструкторОбязательныхПолейПостроке(Строка) Экспорт

	Возврат СтрРазделить(Строка,",", Ложь);
	
КонецФункции