
Функция НеПроверятьСтроку(СтрокаТаблицы,СтруктураПропускаемыхЗначений)
	
	Если СтруктураПропускаемыхЗначений=Неопределено Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
		
	Для Каждого КлючИЗначение ИЗ СтруктураПропускаемыхЗначений Цикл
		
		Если НЕ СтрокаТаблицы[КлючИЗначение.Ключ]=КлючИЗначение.Значение Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
		
КонецФункции // НеПроверятьСтроку() 

Функция СравнитьТаблицыЗначений(ТаблицаЗначений1, ТаблицаЗначений2, СтруктураПропускаемыхЗначений = Неопределено, СтруктураКолонокПоиска = Неопределено) Экспорт
	
	Если ТипЗнч(ТаблицаЗначений1) <> Тип("ТаблицаЗначений") ИЛИ ТипЗнч(ТаблицаЗначений2) <> Тип("ТаблицаЗначений") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если ТаблицаЗначений1.Количество() <> ТаблицаЗначений2.Количество() Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если ТаблицаЗначений1.Колонки.Количество() <> ТаблицаЗначений2.Колонки.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверим поля
	Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
		Если ТаблицаЗначений2.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла; 
	Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
		Если ТаблицаЗначений1.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла; 
	
	// сформируем строку индекса для оптимизации поиска по таблице значений
	СтрокаИндекса = "";
	Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
		Если СтрокаИндекса = "" Тогда
			СтрокаИндекса = Колонка.Имя;
		Иначе
			СтрокаИндекса = СтрокаИндекса+","+Колонка.Имя;
		КонецЕсли;
	КонецЦикла;
	// добавим индекс
	ТаблицаЗначений2.Индексы.Добавить(СтрокаИндекса);
	
	// Проверим записи
	Для каждого СтрокаТаблицы Из ТаблицаЗначений1 Цикл
		
		Если НеПроверятьСтроку(СтрокаТаблицы,СтруктураПропускаемыхЗначений) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура;
				
		Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
						
			Если НЕ (СтруктураКолонокПоиска=Неопределено ИЛИ СтруктураКолонокПоиска.Свойство(Колонка.Имя)) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если СтруктураПропускаемыхЗначений=Неопределено 
				ИЛИ НЕ(СтруктураПропускаемыхЗначений.Свойство(Колонка.Имя) И (СтруктураПропускаемыхЗначений[Колонка.Имя]=СтрокаТаблицы[Колонка.Имя] ИЛИ СтруктураПропускаемыхЗначений[Колонка.Имя]=Неопределено)) Тогда
				
				СтруктураПоиска.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
							
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтруктураПоиска.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиТаблицы2 = ТаблицаЗначений2.НайтиСтроки(СтруктураПоиска);
		Если СтрокиТаблицы2.Количество() <> 1 Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла;
	
	// сформируем строку индекса для оптимизации поиска по таблице значений
	СтрокаИндекса = "";
	Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
		Если СтрокаИндекса = "" Тогда
			СтрокаИндекса = Колонка.Имя;
		Иначе
			СтрокаИндекса = СтрокаИндекса+","+Колонка.Имя;
		КонецЕсли;
	КонецЦикла;
	// добавим индекс
	ТаблицаЗначений1.Индексы.Добавить(СтрокаИндекса);
	
	Для каждого СтрокаТаблицы Из ТаблицаЗначений2 Цикл
		
		Если НеПроверятьСтроку(СтрокаТаблицы,СтруктураПропускаемыхЗначений) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура;
		
		Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
			
			Если НЕ (СтруктураКолонокПоиска=Неопределено ИЛИ СтруктураКолонокПоиска.Свойство(Колонка.Имя)) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если СтруктураПропускаемыхЗначений=Неопределено 
				ИЛИ НЕ(СтруктураПропускаемыхЗначений.Свойство(Колонка.Имя) И (СтруктураПропускаемыхЗначений[Колонка.Имя]=СтрокаТаблицы[Колонка.Имя] ИЛИ СтруктураПропускаемыхЗначений[Колонка.Имя]=Неопределено)) Тогда
				
				СтруктураПоиска.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
							
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтруктураПоиска.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиТаблицы1 = ТаблицаЗначений1.НайтиСтроки(СтруктураПоиска);
		Если СтрокиТаблицы1.Количество() <> 1 Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // СравнитьТаблицыЗначений()


Функция ВариантРазмещенияПоСтрокеСоединения(СтрокаСоединения) Экспорт
	
	Если СтрНайти(СтрокаСоединения, "Srvr=") > 0 Тогда
		Возврат Перечисления.ВариантыРазмещенияИнформационныхБаз.КлиентСерверный;
	ИначеЕсли СтрНайти(СтрокаСоединения, "File=") > 0 Тогда
		Возврат Перечисления.ВариантыРазмещенияИнформационныхБаз.Файловый;
	КонецЕсли;
	
	ВызватьИсключение "Неизвестный вариант размещения в строке соединения";
	
КонецФункции

Функция ИзвлечьПараметрИзСтрокиСоединения(СтрокаСоединения, ИмяПараметра) Экспорт
	
	Поз = СтрНайти(СтрокаСоединения, ИмяПараметра + "=");
	Если Поз = 0 Тогда
		Возврат "";
	КонецЕсли;
	Подстрока = Сред(СтрокаСоединения, Поз + СтрДлина(ИмяПараметра) + 1);
	ПозКонец = СтрНайти(Подстрока, ";");
	Если ПозКонец > 0 Тогда
		Подстрока = Лев(Подстрока, ПозКонец - 1);
	КонецЕсли;  
	
	Возврат СтрЗаменить(Подстрока, """", "");
	
КонецФункции