
Функция ПолучитьЭлемент(Наименование, Синоним) Экспорт
	
	Ссылка = НайтиЭлемент(Наименование);
	Если Ссылка.Пустая() Тогда
		Ссылка = СоздатьЭлемент(Наименование, Синоним);
	КонецЕсли; 
	
	Возврат Ссылка;
	
КонецФункции

Функция НайтиЭлемент(Наименование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыКонфигураций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыКонфигураций КАК ВидыКонфигураций
		|ГДЕ
		|	ВидыКонфигураций.Наименование = &Наименование
		|	И НЕ ВидыКонфигураций.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ВидыКонфигураций.ПустаяСсылка(); 
	
КонецФункции

Функция СоздатьЭлемент(Наименование, Синоним) Экспорт
	
	Объект = Справочники.ВидыКонфигураций.СоздатьЭлемент();
	Объект.Наименование = Наименование;
	Объект.Синоним = Синоним;
	Объект.Записать();
	
	Возврат Объект.Ссылка; 
	
КонецФункции
