
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьВерсииТехнологическойПлатформы();
	
КонецПроцедуры

Процедура ЗаполнитьВерсииТехнологическойПлатформы()
	
	ДанныеЗаполнения = ПолучитьДанныеНачальногоЗаполнения();
	
	Для Каждого Данные Из ДанныеЗаполнения Цикл
		ОписатьВерсиюТехнологическойПлатформы(Данные.НомерВерсии, 
			СтроковыеФункцииКлиентСервер.СтрокаВДату(Данные.ДатаВыхода));	
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеНачальногоЗаполнения()
	
	ДанныеЗаполнения = Справочники.ВерсииТехнологическойПлатформы.ПолучитьМакет("НачальноеЗаполнение");
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ДанныеЗаполнения.Область());  
	Возврат Построитель.Результат.Выгрузить();
	
КонецФункции

Процедура ОписатьВерсиюТехнологическойПлатформы(НомерВерсии, ДатаВыхода) Экспорт
	
	СсылкаВерсии = Справочники.ВерсииТехнологическойПлатформы.НайтиПоНаименованию(НомерВерсии);
	
	Если ЗначениеЗаполнено(СсылкаВерсии) Тогда
		Элемент = СсылкаВерсии.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.ВерсииТехнологическойПлатформы.СоздатьЭлемент();
		Элемент.УстановитьНовыйКод();
	КонецЕсли;
	
	Если Элемент.Наименование <> НомерВерсии Тогда
		Элемент.Наименование = НомерВерсии;
	КонецЕсли;
	
	Если Элемент.ДатаВыхода <> ДатаВыхода Тогда
		Элемент.ДатаВыхода = ДатаВыхода;
	КонецЕсли;
	
	Если Элемент.Модифицированность() Тогда
		Элемент.ОбменДанными.Загрузка = Истина;
		Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Элемент.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
