
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВидКонфигурации)
		ИЛИ НЕ ЗначениеЗаполнено(ЭтотОбъект.Версия) Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущаяВерсия = ВерсииКонфигураций.ПолучитьВерсиюИБ(ЭтотОбъект.Ссылка);
	
	Если ПредыдущаяВерсия = ЭтотОбъект.Версия Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийПериод = ТекущаяДатаСеанса();
	
	МенеджерЗаписи = РегистрыСведений.ВерсииКонфигурацийИБ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущийПериод;
	МенеджерЗаписи.ИнформационнаяБаза = ЭтотОбъект.Ссылка;
	МенеджерЗаписи.Версия = ЭтотОбъект.Версия;
	
	Попытка
		МенеджерЗаписи.Записать(Истина); 
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			"Фиксация изменения версии ИБ",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ВерсииКонфигурацийИБ,
			ЭтотОбъект.Ссылка,
			ТекстОшибки
		);
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Период = ?(ДополнительныеСвойства.Свойство("Период"), ДополнительныеСвойства.Период, ТекущаяДатаСеанса());
	
	ЭтотОбъект.Наименование = ДанныеЗаполнения.СтрокаСоединения;
	ЭтотОбъект.ВариантРазмещения = ДанныеЗаполнения.ВариантРазмещения;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.СерверИБ) Тогда
		ЭтотОбъект.СерверИБ = ДанныеЗаполнения.СерверИБ;
	КонецЕсли;
	ЭтотОбъект.ИмяКаталогИБ = ДанныеЗаполнения.ИмяКаталогИБ;
	
	ЭтотОбъект.ВерсияТехнологическойПлатформы = ДанныеЗаполнения.ВерсияТехнологическойПлатформы;
	ЭтотОбъект.ВидКонфигурации = ДанныеЗаполнения.ВидКонфигурации;
	ЭтотОбъект.Версия = ДанныеЗаполнения.Версия;
	
	// Дефолтные статусы
	Если ЭтотОбъект.ЭтоНовый() Тогда
		ЭтотОбъект.СтатусИБ = Перечисления.СтатусыИнформационныхБаз.Рабочая;
		ЭтотОбъект.СтатусПоддержки = Перечисления.СтатусыПоддержки.НеОпределено;
	Иначе
		СсылкаИБ = ЭтотОбъект.Ссылка;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("СсылкаИБ") Тогда
		// Отсутствует ссылка для записи в регистры
		Возврат;
	КонецЕсли;
	
	СсылкаИБ = ДополнительныеСвойства.СсылкаИБ;
	
	ОбработкаЗаполненияПодсистем(ДанныеЗаполнения.подсистемы, Период, СсылкаИБ);
	ОбработкаЗаполненияРасширений(ДанныеЗаполнения.расширения, Период, СсылкаИБ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаЗаполненияПодсистем(МассивПодсистем, Период, СсылкаИБ)
	
	ТекущиеПодсистемы = ИнформационныеБазы.УстановленныеПодсистемы(СсылкаИБ);

	Для Каждого Подсистема Из МассивПодсистем Цикл
		Отбор = Новый Структура("Подсистема, Версия", Подсистема.Подсистема, Подсистема.Версия);
		Найденные = ТекущиеПодсистемы.НайтиСтроки(Отбор);
		Если Найденные.Количество() > 0 И Не Найденные[0].Исключить Тогда
			Продолжить;
		КонецЕсли;
		
		ИнформационныеБазы.ЗафиксироватьПодсистему(СсылкаИБ, Подсистема.Подсистема, Подсистема.Версия, Ложь, Период);
	КонецЦикла;
	
	Для Каждого СтрокаСреза Из ТекущиеПодсистемы Цикл
		Если СтрокаСреза.Исключить Тогда
			Продолжить;
		КонецЕсли;
		
		НайденоВДанных = Ложь;
		Для Каждого Подсистема Из МассивПодсистем Цикл
			Если Подсистема.Подсистема = СтрокаСреза.Подсистема Тогда
				НайденоВДанных = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не НайденоВДанных Тогда
			ИнформационныеБазы.ЗафиксироватьПодсистему(СсылкаИБ, СтрокаСреза.Подсистема, СтрокаСреза.Версия, Истина, Период);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияРасширений(МассивРасширений, Период, СсылкаИБ)
	
	ТекущиеРасширения = ИнформационныеБазы.УстановленныеРасширенияКонфигурации(СсылкаИБ);
	
	Для Каждого Расширение Из МассивРасширений Цикл
		Отбор = Новый Структура("РасширениеКонфигурации, Версия", Расширение.РасширениеКонфигурации, Расширение.Версия);
		Найденные = ТекущиеРасширения.НайтиСтроки(Отбор);
		Изменено = Истина;
		Если Найденные.Количество() > 0 И Не Найденные[0].Исключить Тогда
			СтрокаСреза = Найденные[0];
			Изменено = (СтрокаСреза.ХешСумма <> Расширение.ХешСумма)
				ИЛИ (СтрокаСреза.Активно <> Расширение.Активно)
				ИЛИ (СтрокаСреза.Назначение <> Расширение.Назначение)
				ИЛИ (СтрокаСреза.БезопасныйРежим <> Расширение.БезопасныйРежим);
		КонецЕсли;
		
		Если Изменено Или Найденные.Количество() = 0 Тогда
			Модифицировано = Расширение.ХешСумма <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Расширение.Версия, "ХешСумма");
			ИнформационныеБазы.ЗафиксироватьРасширениеКонфигурации(СсылкаИБ, Расширение.РасширениеКонфигурации, Расширение.Версия, Ложь, Расширение.ХешСумма, Расширение.Активно, 
				Расширение.Назначение, Расширение.БезопасныйРежим, Модифицировано, Период);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаСреза Из ТекущиеРасширения Цикл
		Если СтрокаСреза.Исключить Тогда
			Продолжить;
		КонецЕсли;
		
		НайденоВДанных = Ложь;
		Для Каждого Расширение Из МассивРасширений Цикл
			Если Расширение.РасширениеКонфигурации = СтрокаСреза.РасширениеКонфигурации Тогда
				НайденоВДанных = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не НайденоВДанных Тогда
			ИнформационныеБазы.ЗафиксироватьРасширениеКонфигурации(СсылкаИБ, СтрокаСреза.РасширениеКонфигурации, СтрокаСреза.Версия, Истина, СтрокаСреза.ХешСумма, СтрокаСреза.Активно, 
				СтрокаСреза.Назначение, СтрокаСреза.БезопасныйРежим, СтрокаСреза.Модифицировано, Период);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

