
Функция ПолучитьЭлемент(Подсистема, Версия) Экспорт
	
	Ссылка = НайтиЭлемент(Подсистема, Версия);
	Если Ссылка.Пустая() Тогда
		Ссылка = СоздатьЭлемент(Подсистема, Версия);
	КонецЕсли;	
	Возврат Ссылка;
	
КонецФункции

Функция НайтиЭлемент(Подсистема, Версия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииПодсистем.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВерсииПодсистем КАК ВерсииПодсистем
		|ГДЕ
		|	ВерсииПодсистем.Подсистема = &Подсистема
		|	И ВерсииПодсистем.Наименование = &Версия
		|	И НЕ ВерсииПодсистем.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Подсистема", Подсистема);
	Запрос.УстановитьПараметр("Версия", Версия);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ВерсииПодсистем.ПустаяСсылка();
	
КонецФункции

Функция СоздатьЭлемент(Подсистема, Версия) Экспорт
	
	Объект = Справочники.ВерсииПодсистем.СоздатьЭлемент();
	Объект.Подсистема = Подсистема;
	Объект.Наименование = Версия;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции
