
Функция ПолучитьЭлемент(Наименование, ТипСервера) Экспорт
	
	Ссылка = НайтиЭлемент(Наименование, ТипСервера);
	Если Ссылка.Пустая() Тогда
		Ссылка = СоздатьЭлемент(Наименование, ТипСервера);
	КонецЕсли;
	Возврат Ссылка;
	
КонецФункции

Функция НайтиЭлемент(Наименование, ТипСервера) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Серверы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Серверы КАК Серверы
		|ГДЕ
		|	Серверы.Наименование = &Наименование
		|	И Серверы.ТипСервера = &ТипСервера
		|	И НЕ Серверы.ПометкаУдаления"; 
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("ТипСервера", ТипСервера);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Серверы.ПустаяСсылка();
	
КонецФункции

Функция СоздатьЭлемент(Наименование, ТипСервера) Экспорт
	
	СерверОбъект = Справочники.Серверы.СоздатьЭлемент();
	СерверОбъект.Наименование = Наименование;
	СерверОбъект.ТипСервера = ТипСервера;
	СерверОбъект.Порт = ПортПоУмолчанию(ТипСервера);
	СерверОбъект.Записать();
	
	Возврат СерверОбъект.Ссылка;
	
КонецФункции


Функция ПроверитьПорт(Порт) Экспорт
	
	Если Порт < 1 Или Порт > 65535 Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции 

Функция ПортПоУмолчанию(ТипСервера) Экспорт
	
	Если ТипСервера = Перечисления.ТипыСерверов.Кластер1С Тогда
		Возврат 1541;
	КонецЕсли;
	Возврат 1;
	
КонецФункции