
#Область ОбработчиикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	
	ТекущаяДата = ТекущаяДатаСеанса();
	АктуальныйСостав = ОтветственныеЛица.ПолучитьАктуальныйСостав(ТекущаяДата, Объект.Ссылка);
	СоставОтветственныхЛиц.Загрузить(АктуальныйСостав);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	НовыйСостав = СоставОтветственныхЛиц.Выгрузить();
	
	ОтветственныеЛица.ЗаписатьСостав(ТекущаяДата, НовыйСостав, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтветственныеЛицаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеЛицаПослеУдаления(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеЛицаОтветственныйПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставОтветственныхЛиц.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КонтактныеДанные = ОтветственныеЛица.ПолучитьКонтактныеДанные(ТекущиеДанные.Ответственный);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, КонтактныеДанные);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СоставОтветственныхЛицПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Возврат;
	//КонецЕсли; 
	//
	//ТекстВопроса = НСтр("ru='Добавление ответственного возможно только после сохранения элемента. Сохранить?'");
	//Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	//Если Результат = КодВозвратаДиалога.Да Тогда
	//	Записать();
	//Иначе
	//	Отказ = Истина;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти


