
Функция ПолучитьЭлемент(Имя) Экспорт
	
	Ссылка = НайтиЭлемент(Имя);
	Если Ссылка.Пустая() Тогда
		Ссылка = СоздатьЭлемент(Имя);
	КонецЕсли;
	Возврат Ссылка;
	
КонецФункции

Функция НайтиЭлемент(Имя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подсистемы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Подсистемы КАК Подсистемы
		|ГДЕ
		|	Подсистемы.Наименование = &Имя
		|	И НЕ Подсистемы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Имя", Имя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Подсистемы.ПустаяСсылка();
	
КонецФункции

Функция СоздатьЭлемент(Имя) Экспорт
	
	Объект = Справочники.Подсистемы.СоздатьЭлемент();
	Объект.Наименование = Имя;
	//Объект.Синоним = Имя;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции
