
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ТипСервера) Тогда
		ВызватьИсключение НСтр("ru = 'Тип сервера должн быть заполнен.'");
	КонецЕсли;
	
	ТекстСообщенияПорт = НСтр("ru = 'Порт должен быть в диапазоне 1-65535.'");
	Если НЕ Серверы.ПроверитьПорт(Порт) Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПорт, ЭтотОбъект, "Объект.ПортСервера",, Отказ);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтоКластер1С = (ТипСервера = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Перечисление.ТипыСерверов.Кластер1С"));
	
	Если ЭтоКластер1С Тогда
		МассивНепроверяемыхРеквизитов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ТипСУБД");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры
