
Функция НайтиЭлементПоИдентификатору(ИдентификаторИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформационныеБазы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
		|ГДЕ
		|	ИнформационныеБазы.ИдентификаторИБ = &ИдентификаторИБ";
	Запрос.УстановитьПараметр("ИдентификаторИБ", ИдентификаторИБ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ИнформационныеБазы.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция УстановленныеПодсистемы(СсылкаИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеПодсистемы.Подсистема КАК Подсистема,
		|	УстановленныеПодсистемы.Версия КАК Версия,
		|	УстановленныеПодсистемы.Исключить КАК Исключить
		|ИЗ
		|	РегистрСведений.УстановленныеПодсистемы.СрезПоследних(, ИнформационнаяБаза = &ИБ) КАК УстановленныеПодсистемы
		|ГДЕ
		|	НЕ УстановленныеПодсистемы.Исключить";
	
	Запрос.УстановитьПараметр("ИБ", СсылкаИБ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция УстановленныеРасширенияКонфигурации(СсылкаИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеРасширенияКонфигураций.РасширениеКонфигурации КАК РасширениеКонфигурации,
		|	УстановленныеРасширенияКонфигураций.Версия КАК Версия,
		|	УстановленныеРасширенияКонфигураций.Исключить КАК Исключить,
		|	УстановленныеРасширенияКонфигураций.ХешСумма КАК ХешСумма,
		|	УстановленныеРасширенияКонфигураций.Активно КАК Активно,
		|	УстановленныеРасширенияКонфигураций.Назначение КАК Назначение,
		|	УстановленныеРасширенияКонфигураций.БезопасныйРежим КАК БезопасныйРежим,
		|	УстановленныеРасширенияКонфигураций.Модифицировано КАК Модифицировано
		|ИЗ
		|	РегистрСведений.УстановленныеРасширенияКонфигураций.СрезПоследних(, ИнформационнаяБаза = &ИБ) КАК УстановленныеРасширенияКонфигураций
		|ГДЕ
		|	НЕ УстановленныеРасширенияКонфигураций.Исключить";
	
	Запрос.УстановитьПараметр("ИБ", СсылкаИБ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗафиксироватьПодсистему(СсылкаИБ, Подсистема, Версия, Исключить, Период) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.УстановленныеПодсистемы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.ИнформационнаяБаза = СсылкаИБ;
	МенеджерЗаписи.Подсистема = Подсистема;
	МенеджерЗаписи.Версия = Версия;
	МенеджерЗаписи.Исключить = Исключить;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ЗафиксироватьРасширениеКонфигурации(СсылкаИБ, Расширение, Версия, Исключить, ХешСумма, Активно, Назначение, БезопасныйРежим, Модифицировано, Период) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.УстановленныеРасширенияКонфигураций.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.ИнформационнаяБаза = СсылкаИБ;
	МенеджерЗаписи.РасширениеКонфигурации = Расширение;
	МенеджерЗаписи.Версия = Версия;
	МенеджерЗаписи.Исключить = Исключить;
	МенеджерЗаписи.ХешСумма = ХешСумма;
	МенеджерЗаписи.Активно = Активно;
	МенеджерЗаписи.Назначение = Назначение;
	МенеджерЗаписи.БезопасныйРежим = БезопасныйРежим;
	МенеджерЗаписи.Модифицировано = Модифицировано;
	МенеджерЗаписи.Записать(Истина);

КонецПроцедуры 

Процедура УстановитьБлокировку(ИдентификаторИБ, СсылкаИБ) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ИнформационныеБазы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторИБ", ИдентификаторИБ);
	
	Если НЕ СсылкаИБ.Пустая() Тогда
	
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПолученныеДанныеИБ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ИнформационнаяБаза", СсылкаИБ);
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УстановленныеПодсистемы");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ИнформационнаяБаза", СсылкаИБ);
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УстановленныеРасширенияКонфигураций");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ИнформационнаяБаза", СсылкаИБ);
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ВерсииКонфигурацийИБ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ИнформационнаяБаза", СсылкаИБ);
	
	КонецЕсли;
	
	Блокировка.Заблокировать();
	
КонецПроцедуры