
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипБДПриИзменении(Элемент)
	НастроитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	ЭтоСУБД = (Объект.ТипСервера = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Перечисление.ТипыСерверов.СУБД")); 
	
	Элементы.ТипСУБД.Видимость = ЭтоСУБД;
	
КонецПроцедуры

#КонецОбласти
