
Функция ПолучитьЭлемент(Имя, Синоним) Экспорт
	
	Ссылка = НайтиЭлемент(Имя);
	Если Ссылка.Пустая() Тогда
		Ссылка = СоздатьЭлемент(Имя, Синоним);
	КонецЕсли;
	Возврат Ссылка;
	
КонецФункции

Функция НайтиЭлемент(Имя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасширенияКонфигураций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РасширенияКонфигураций КАК РасширенияКонфигураций
		|ГДЕ
		|	РасширенияКонфигураций.Наименование = &Имя
		|	И НЕ РасширенияКонфигураций.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Имя", Имя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.РасширенияКонфигураций.ПустаяСсылка();
	
КонецФункции

Функция СоздатьЭлемент(Имя, Синоним) Экспорт
	
	Объект = Справочники.РасширенияКонфигураций.СоздатьЭлемент();
	Объект.Наименование = Имя;
	//Объект.КодПрограммы = Имя;
	Объект.Синоним = Синоним;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции