
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область СлужебныеПроцедурыИФункции

Функция НайтиПоРеквизитам(СтруктураПоиска) Экспорт
	
	Если ТипЗнч(СтруктураПоиска) <> Тип("Структура") Тогда
		Возврат Справочники.ВерсииПодсистем.ПустаяСсылка();
	КонецЕсли;
	
	Если СтруктураПоиска.Количество() = 0 Тогда
		Возврат Справочники.ВерсииПодсистем.ПустаяСсылка();
	КонецЕсли;
	
	Условие = "ГДЕ ";
	Первый = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВерсииПодсистем.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВерсииПодсистем КАК ВерсииПодсистем";
	
	Для Каждого КиЗ Из СтруктураПоиска Цикл
		Если Не Первый Тогда
			Условие = Условие + Символы.ПС + "И ";
		КонецЕсли;
		Условие = Условие + "ВерсииПодсистем." + КиЗ.Ключ + " = &" + КиЗ.Ключ;
		Запрос.УстановитьПараметр(КиЗ.Ключ, КиЗ.Значение);
		Первый = Ложь;
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + Символы.ПС + Условие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ВерсииПодсистем.ПустаяСсылка();
	
КонецФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьВерсииПодсистем();
	
КонецПроцедуры

Процедура ЗаполнитьВерсииПодсистем()
	
	ОписатьВерсиюПодсистемы(Справочники.Подсистемы.СтандартныеПодсистемы, "3.1.10.467");
	
КонецПроцедуры

Процедура ОписатьВерсиюПодсистемы(Подсистема, НомерВерсии) Экспорт
	
	СсылкаВерсии = Справочники.ВерсииПодсистем.НайтиПоРеквизитам(Новый Структура("Подсистема,Наименование", Подсистема, НомерВерсии));
	
	Если ЗначениеЗаполнено(СсылкаВерсии) Тогда
		Элемент = СсылкаВерсии.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.ВерсииПодсистем.СоздатьЭлемент();
		Элемент.УстановитьНовыйКод();
	КонецЕсли;
	
	Если Элемент.Наименование <> НомерВерсии Тогда
		Элемент.Наименование = НомерВерсии;
	КонецЕсли;
	
	Если Элемент.Подсистема <> Подсистема Тогда
		Элемент.Подсистема = Подсистема;
	КонецЕсли;
		
	Если Элемент.Модифицированность() Тогда
		Элемент.ОбменДанными.Загрузка = Истина;
		Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Элемент.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
