
Функция ПолучитьЭлемент(Расширение, Версия, ХешСумма) Экспорт
	
	Ссылка = НайтиЭлемент(Расширение, Версия);
	Если Ссылка.Пустая() Тогда
		Ссылка = СоздатьЭлемент(Расширение, Версия, ХешСумма);
	КонецЕсли;
	Возврат Ссылка;
	
КонецФункции

Функция НайтиЭлемент(Расширение, Версия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииРасширенийКонфигураций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВерсииРасширенийКонфигураций КАК ВерсииРасширенийКонфигураций
		|ГДЕ
		|	ВерсииРасширенийКонфигураций.Расширение = &Расширение
		|	И ВерсииРасширенийКонфигураций.Наименование = &Версия
		|	И НЕ ВерсииРасширенийКонфигураций.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Расширение", Расширение);
	Запрос.УстановитьПараметр("Версия", ?(Версия <> "", Версия, "<без версии>"));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Справочники.ВерсииРасширенийКонфигураций.ПустаяСсылка();
	
КонецФункции

Функция СоздатьЭлемент(Расширение, Версия, ХешСумма) Экспорт
	
	Объект = Справочники.ВерсииРасширенийКонфигураций.СоздатьЭлемент();
	Объект.Расширение = Расширение;
	Объект.Наименование = ?(Версия <> "", Версия, НСтр("ru='<без версии>'"));
	Объект.ДатаВыхода = ТекущаяДатаСеанса(); // ?
	Объект.ХешСумма = ХешСумма;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции